app/controllers/comments_controller.rb

	def create
    	@post = Post.find(params[:post_id])
    	@comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "sarah"], ["body", "hghjgfdshjdgfjhdsfg sjfgfhuidsf\r\n"], ["post_id", 2], ["created_at", "2015-12-07 02:25:58.576085"], ["updated_at", "2015-12-07 02:25:58.576085"]]